CSI API ETABS v1
cCaseResponseSpectrum.GetDampType Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDampType(
	string Name,
	ref int DampType
)
Function GetDampType (
	Name As String,
	ByRef DampType As Integer
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim DampType As Integer
Dim returnValue As Integer
returnValue = instance.GetDampType(Name,
	DampType)
int GetDampType(
	String^ Name,
	int% DampType
)
abstract GetDampType :
        Name : string *
        DampType : int byref -> int
Parameters
Name
Type: System.String
DampType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace